app/controllers/cashes_controller.rb

SELECT "cashes".* FROM "cashes"
---
  def index
    @cashes = Cash.all

INSERT INTO "cashes" ("concept", "coin", "entry", "egress", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["concept", "venta de computadora"], ["coin", "dolar"], ["entry", 245.3], ["egress", 233.3], ["created_at", "2018-10-04 04:43:49.603471"], ["updated_at", "2018-10-04 04:43:49.603471"]]
---
  def create
    @cash = Cash.new(cash_params)

    respond_to do |format|
      if @cash.save

DELETE FROM "cashes" WHERE "cashes"."id" = $1  [["id", 3]]
---
  def destroy
    @cash.destroy

SELECT  "cashes".* FROM "cashes" WHERE "cashes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_cash
      @cash = Cash.find(params[:id])